<?php

namespace Modules\Admin\Database\Seeders;

use App\Page;
use Illuminate\Database\Seeder;
use Illuminate\Database\Eloquent\Model;
use Illuminate\Support\Facades\DB;

class PagesTableSeeder extends Seeder
{
    public function run()
    {
        Model::unguard();
        if(Page::count() == 0){
            DB::table('pages')->insert([
                [
                    'title' => 'about',
                    'content' => 'الوقف لغةً: يطلق على الحبس والكفّ، ويُجمع على أوقاف ووقوف.[١] الوقف في الاصطلاح الشرعي: هو حبس عين المال وتسبيل منفعته؛ طلباً للأجر من الله تعالى،[٢] ويُقصد بالعين الشيء الذي يُمكن الانتفاع به مع بقاء أصله، مثل البيوت والأراضي وغيرها، ويقصد بتسبيل المنفعة أي تخصيصها لوجه الله تعالى، أما المنفعة فهي ما ينتج عن الأصل الأجرة والربح وغيرها من المنافع.[٣][٤] الوقف عند المذاهب الفقهية: اختلف الفقهاء في تعريف الوقف بسبب اختلاف مذاهبهم في حقيقته، وبيان تعريف الوقف في المذاهب الأربعة فيما يأت',
                    'slug' => 'about'
                ],
                [
                    'title' => 'terms',
                    'content' => '​​​​​​إن دخولك واستخدامك للموقع الإلكتروني لهيئة الصحة بدب​​​ي"الموقع" يخضع للشروط والأحكام التالية، بالإضافة إلى قوانين دولة الإمارات العربية المتحدة. دخولك إلى الموقع يعني موافقتك على هذه الشروط والأحكام، سواء كنت مستخدماً مسجلاً أم لا. وبدخولك وتصفحك واستخدامك للموقع فإنك تكون قد قبلت، من دون قيد أو شرط، أحكام وشروط الاستخدام الواردة في هذه الوثيقة',
                    'slug' => 'terms'
                ],
                [
                    'title' => 'privacy',
                    'content' => ' لهيئة الصحة بدبي الحق في تعديل هذه الشروط والأحكام على أن يتم وضع إشعار بحدوث تعديلات على هذه الصفحة، وتدخل التعديلات حيز النفاذ بمجرد إحداثها مالم ينَصّ بخلاف ذلك. إن استخدامك المتكرر للموقع بعد إحداث تلك التعديلات يعني موافقتك على التعديلات. ويتعين عليك القيام بزيارات دورية لهذه الصفحة لمراجعة شروط وأحكام الاستخدام الحالية.',
                    'slug' => 'privacy'
                ]
            ]);
            DB::table('generallsetting')->insert([
                [
                    'site_title_ar' => 'Waqf',
                    'email' => 'about@Waqf.com',
                    'site_mobile' => '0123654789',
                    'site_phone' => '1236045987',
                    'facebook_url' => 'https://www.facebook.com/',
                    'twitter_url' => 'https://www.twitter.com/',
                    'instagram' => 'https://www.instagram.com/',
                    'site_addresse_ar' => '15 شارع عبدالله بن مسعود النسيم الغربي الرياض ',
                    'site_aboutus_ar' => 'الوقف لغةً: يطلق على الحبس والكفّ، ويُجمع على أوقاف ووقوف.[١] الوقف في الاصطلاح الشرعي: هو حبس عين المال وتسبيل منفعته؛ طلباً للأجر من الله تعالى،[٢] ويُقصد بالعين الشيء الذي يُمكن الانتفاع به مع بقاء أصله، مثل البيوت والأراضي وغيرها، ويقصد بتسبيل المنفعة أي تخصيصها لوجه الله تعالى، أما المنفعة فهي ما ينتج عن الأصل الأجرة والربح وغيرها من المنافع.[٣][٤] الوقف عند المذاهب الفقهية: اختلف الفقهاء في تعريف الوقف بسبب اختلاف مذاهبهم في حقيقته، وبيان تعريف الوقف في المذاهب الأربعة فيما يأتي:[٥]'                ]
            ]);
        }

    }
}
