<?php

return [
    'login' => 'تسجيل الدخول',
    'sign_in' => 'الدخول',
    'register' => 'تسجيل',
    'reset_password' => 'إعادة تعيين كلمة المرور',
    'forget_password' => 'نسيت كلمة المرور',
    'profile' => 'الملف الشخصي',
    'sign_out' => 'تسجيل الخروج',
    'logout' => 'تسجيل الخروج',
    'code_for_confirm_login' => 'تاكيد الدخول',
    'messages' => [
    'errors' => [
        'not_active_check' => 'لم يتم تاكيد حسابك بعد يرجى الرجوع للبريد الالكترونى وادخال الكود الخاص بكم من خلال اللينك الموجود فى الايميل',
        'not_active' => 'لم يتم تفعيل حسابك بعد',
        'blocked' => 'لقد تم ايقاف حسابك من فضلك قم بتواصل مع الادارة',
        'auth_wrong' => 'بيانات الدخول خاطئة من فضلك حاول مرة اخري',
        'invalid_code' => 'رمز تاكيد الدخول غير صحيح'
    ],
    'successes' => [
        'success' => 'تم الدخول بنجاح'
    ],
    'warnings' => [
        'attention' => 'انتبه',
    ]
]
];
